//游戏菜单首页
#pragma once
#include "Tool.h"

class TitleScreen
{
public:

	void Menu_Print_First(Tool& t);
	void Menu_Print_After(Tool& t);
	void Confirm_Print_Exit(Tool& t, int judge);

	void Position_Title(int x0, int y0, int x1, int y1, Tool& t);
	int  ClueJudge_Title(int x1, int y1);
	int  ClueJudge_Confirm(int x1, int y1);

	void Movement_Title(int number, int& x0, int& y0, int x1, int y1, Tool& t);
	void Movement_Confirm(int number, int& x0, int& y0, int x1, int y1, Tool& t, int judge);
	void Execute_Title(int);
	void Execute_Confirm(Tool& t, int, int);

	//标题地图
	int map_Title[16][15] = { 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
							  1,0,0,0,0,1,1,1,1,1,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,2,2,2,2,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,3,3,3,3,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,4,4,4,4,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,0,0,0,0,5,5,5,5,0,0,0,0,0,1,
							  1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
							  1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 };

	//确认地图
	int map_Confirm[10][15] = { 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
								1,0,0,0,1,1,1,1,1,1,1,0,0,0,1,
								1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
								1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
								1,0,0,0,0,0,2,2,0,0,0,0,0,0,1,
								1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
								1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
								1,0,0,0,0,0,3,3,0,0,0,0,0,0,1,
								1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
								1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 };
};
